Complete restructure to encapsulate both the dataset sourcing and the LoRa training process
